app/controllers/volunteer/profiles_controller.rb

	def update
		@volunteer.weekly_hrs = params[:weekly_hrs]
		@volunteer.save
---
UPDATE "volunteers" SET "weekly_hrs" = $1, "updated_at" = $2 WHERE "volunteers"."id" = $3  [["weekly_hrs", 5], ["updated_at", "2015-10-04 01:07:18.250280"], ["id", 1]]

	def set_volunteer
	  @volunteer = Volunteer.find(params[:id]) if params[:id]
---
SELECT  "volunteers".* FROM "volunteers" WHERE "volunteers"."id" = $1 LIMIT 1  [["id", 1]]