app/controllers/departments_controller.rb

SELECT  "departments".* FROM "departments" WHERE "departments"."id" = $1 LIMIT 1  [["id", 1]]
---
	def set_department
	  @department = Department.find(params[:id])